Oryx-Embedded/CycloneTCP/drivers/mac/apm32f4xx_eth_driver.c
/**
 * @file apm32f4xx_eth_driver.c
 * @brief APM32F4 Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "apm32f4xx.h"
#include "apm32f4xx_rcm.h"
#include "apm32f4xx_syscfg.h"
#include "apm32f4xx_gpio.h"
#include "core/net.h"
#include "drivers/mac/apm32f4xx_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
static uint8_t txBuffer[APM32F4XX_ETH_TX_BUFFER_COUNT][APM32F4XX_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
static uint8_t rxBuffer[APM32F4XX_ETH_RX_BUFFER_COUNT][APM32F4XX_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 4
static Apm32f4xxTxDmaDesc txDmaDesc[APM32F4XX_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 4
static Apm32f4xxRxDmaDesc rxDmaDesc[APM32F4XX_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[APM32F4XX_ETH_TX_BUFFER_COUNT][APM32F4XX_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(4)));
//Receive buffer
static uint8_t rxBuffer[APM32F4XX_ETH_RX_BUFFER_COUNT][APM32F4XX_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(4)));
//Transmit DMA descriptors
static Apm32f4xxTxDmaDesc txDmaDesc[APM32F4XX_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4)));
//Receive DMA descriptors
static Apm32f4xxRxDmaDesc rxDmaDesc[APM32F4XX_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4)));

#endif

//Pointer to the current TX DMA descriptor
static Apm32f4xxTxDmaDesc *txCurDmaDesc;
//Pointer to the current RX DMA descriptor
static Apm32f4xxRxDmaDesc *rxCurDmaDesc;


/**
 * @brief APM32F4 Ethernet MAC driver
 **/

const NicDriver apm32f4xxEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   apm32f4xxEthInit,
   apm32f4xxEthTick,
   apm32f4xxEthEnableIrq,
   apm32f4xxEthDisableIrq,
   apm32f4xxEthEventHandler,
   apm32f4xxEthSendPacket,
   apm32f4xxEthUpdateMacAddrFilter,
   apm32f4xxEthUpdateMacConfig,
   apm32f4xxEthWritePhyReg,
   apm32f4xxEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief APM32F4 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t apm32f4xxEthInit(NetInterface *interface)
{
   error_t error;

   //Debug message
   TRACE_INFO("Initializing APM32F4 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   apm32f4xxEthInitGpio(interface);

   //Enable Ethernet MAC clock
   RCM_EnableAHB1PeriphClock(RCM_AHB1_PERIPH_ETH_MAC |
      RCM_AHB1_PERIPH_ETH_MAC_Tx | RCM_AHB1_PERIPH_ETH_MAC_Rx);

   //Reset Ethernet MAC peripheral
   RCM_EnableAHB1PeriphReset(RCM_AHB1_PERIPH_ETH_MAC);
   RCM_DisableAHB1PeriphReset(RCM_AHB1_PERIPH_ETH_MAC);

   //Perform a software reset
   ETH->DMABMOD |= ETH_DMABMOD_SWR;
   //Wait for the reset to complete
   while((ETH->DMABMOD & ETH_DMABMOD_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on HCLK frequency
   ETH->ADDR = ETH_ADDR_CR_DIV_102;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   ETH->CFG = ETH_CFG_RESERVED15 | ETH_CFG_DISRXO;

   //Set the MAC address of the station
   ETH->ADDR0L = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   ETH->ADDR0H = interface->macAddr.w[2] | ETH_ADDR0H_AL1;

   //The MAC supports 3 additional addresses for unicast perfect filtering
   ETH->ADDR1L = 0;
   ETH->ADDR1H = 0;
   ETH->ADDR2L = 0;
   ETH->ADDR2H = 0;
   ETH->ADDR3L = 0;
   ETH->ADDR3H = 0;

   //Initialize hash table
   ETH->HTL = 0;
   ETH->HTH = 0;

   //Configure the receive filter
   ETH->FRAF = ETH_FRAF_HPF | ETH_FRAF_HMC;
   //Disable flow control
   ETH->FCTRL = 0;
   //Enable store and forward mode
   ETH->DMAOPMOD = ETH_DMAOPMOD_RXSF | ETH_DMAOPMOD_TXSF;

   //Configure DMA bus mode
   ETH->DMABMOD = ETH_DMABMOD_AAL | ETH_DMABMOD_USP | ETH_DMABMOD_RPBL_32 |
      ETH_DMABMOD_PR_1_1 | ETH_DMABMOD_PBL_32 | ETH_DMABMOD_EDFEN;

   //Initialize DMA descriptor lists
   apm32f4xxEthInitDmaDesc(interface);

   //Prevent interrupts from being generated when the transmit statistic
   //counters reach half their maximum value
   ETH->TXINT = ETH_TXINT_TXGF | ETH_TXINT_TXGFMCOL | ETH_TXINT_TXGFSCOL;

   //Prevent interrupts from being generated when the receive statistic
   //counters reach half their maximum value
   ETH->RXINT = ETH_RXINT_RXGUNF | ETH_RXINT_RXFAE | ETH_RXINT_RXFCE;

   //Disable MAC interrupts
   ETH->IMASK = ETH_IMASK_TSTIM | ETH_IMASK_PMTIM;
   //Enable the desired DMA interrupts
   ETH->DMAINTEN = ETH_DMAINTEN_NINTSEN | ETH_DMAINTEN_RXIEN | ETH_DMAINTEN_TXIEN;

   //Set priority grouping (4 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(APM32F4XX_ETH_IRQ_PRIORITY_GROUPING);

