Oryx-Embedded/CycloneTCP/drivers/mac/apm32f4xx_eth_driver.c
            //The upper 6 bits in the CRC register are used to index the
            //contents of the hash table
            k = (crc >> 26) & 0x3F;

            //Update hash table contents
            hashTable[k / 32] |= (1 << (k % 32));
         }
         else
         {
            //Up to 3 additional MAC addresses can be specified
            if(j < 3)
            {
               //Save the unicast address
               unicastMacAddr[j++] = entry->addr;
            }
         }
      }
   }

   //Configure the first unicast address filter
   if(j >= 1)
   {
      //When the AE bit is set, the entry is used for perfect filtering
      ETH->ADDR1L = unicastMacAddr[0].w[0] | (unicastMacAddr[0].w[1] << 16);
      ETH->ADDR1H = unicastMacAddr[0].w[2] | ETH_ADDR1H_ADDREN;
   }
   else
   {
      //When the AE bit is cleared, the entry is ignored
      ETH->ADDR1L = 0;
      ETH->ADDR1H = 0;
   }

   //Configure the second unicast address filter
   if(j >= 2)
   {
      //When the AE bit is set, the entry is used for perfect filtering
      ETH->ADDR2L = unicastMacAddr[1].w[0] | (unicastMacAddr[1].w[1] << 16);
      ETH->ADDR2H = unicastMacAddr[1].w[2] | ETH_ADDR2H_ADDREN;
   }
   else
   {
      //When the AE bit is cleared, the entry is ignored
      ETH->ADDR2L = 0;
      ETH->ADDR2H = 0;
   }

   //Configure the third unicast address filter
   if(j >= 3)
   {
      //When the AE bit is set, the entry is used for perfect filtering
      ETH->ADDR3L = unicastMacAddr[2].w[0] | (unicastMacAddr[2].w[1] << 16);
      ETH->ADDR3H = unicastMacAddr[2].w[2] | ETH_ADDR3H_ADDREN;
   }
   else
   {
      //When the AE bit is cleared, the entry is ignored
      ETH->ADDR3L = 0;
      ETH->ADDR3H = 0;
   }

   //Configure the multicast hash table
   ETH->HTL = hashTable[0];
   ETH->HTH = hashTable[1];

   //Debug message
   TRACE_DEBUG("  HTL = 0x%08" PRIX32 "\r\n", ETH->HTL);
   TRACE_DEBUG("  HTH = 0x%08" PRIX32 "\r\n", ETH->HTH);

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Adjust MAC configuration parameters for proper operation
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t apm32f4xxEthUpdateMacConfig(NetInterface *interface)
{
   uint32_t config;

   //Read current MAC configuration
   config = ETH->CFG;

   //10BASE-T or 100BASE-TX operation mode?
   if(interface->linkSpeed == NIC_LINK_SPEED_100MBPS)
   {
      config |= ETH_CFG_SSEL;
   }
   else
   {
      config &= ~ETH_CFG_SSEL;
   }

   //Half-duplex or full-duplex mode?
   if(interface->duplexMode == NIC_FULL_DUPLEX_MODE)
   {
      config |= ETH_CFG_DM;
   }
   else
   {
      config &= ~ETH_CFG_DM;
   }

   //Update MAC configuration register
   ETH->CFG = config;

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Write PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @param[in] data Register value
 **/

void apm32f4xxEthWritePhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr, uint16_t data)
{
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_WRITE)
   {
      //Take care not to alter MDC clock configuration
      temp = ETH->ADDR & ETH_ADDR_CR;
      //Set up a write operation
      temp |= ETH_ADDR_MW | ETH_ADDR_MB;
      //PHY address
      temp |= (phyAddr << 11) & ETH_ADDR_PA;
      //Register address
      temp |= (regAddr << 6) & ETH_ADDR_MR;

      //Data to be written in the PHY register
      ETH->DATA = data & ETH_DATA_MD;

      //Start a write operation
      ETH->ADDR = temp;
      //Wait for the write to complete
      while((ETH->ADDR & ETH_ADDR_MB) != 0)
      {
      }
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
   }
}


/**
 * @brief Read PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @return Register value
 **/

uint16_t apm32f4xxEthReadPhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr)
{
   uint16_t data;
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_READ)
   {
      //Take care not to alter MDC clock configuration
      temp = ETH->ADDR & ETH_ADDR_CR;
      //Set up a read operation
      temp |= ETH_ADDR_MB;
      //PHY address
      temp |= (phyAddr << 11) & ETH_ADDR_PA;
      //Register address
      temp |= (regAddr << 6) & ETH_ADDR_MR;

      //Start a read operation
      ETH->ADDR = temp;
      //Wait for the read to complete
      while((ETH->ADDR & ETH_ADDR_MB) != 0)
      {
      }

      //Get register value
      data = ETH->DATA & ETH_DATA_MD;
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
      data = 0;
   }

   //Return the value of the PHY register
   return data;
}


/**
 * @brief CRC calculation
 * @param[in] data Pointer to the data over which to calculate the CRC
 * @param[in] length Number of bytes to process
 * @return Resulting CRC value
 **/

uint32_t apm32f4xxEthCalcCrc(const void *data, size_t length)
{
   uint_t i;
   uint_t j;
   uint32_t crc;
   const uint8_t *p;

   //Point to the data over which to calculate the CRC
   p = (uint8_t *) data;
   //CRC preset value
   crc = 0xFFFFFFFF;

   //Loop through data
   for(i = 0; i < length; i++)
   {
      //The message is processed bit by bit
      for(j = 0; j < 8; j++)
      {
         //Update CRC value
         if((((crc >> 31) ^ (p[i] >> j)) & 0x01) != 0)
         {
            crc = (crc << 1) ^ 0x04C11DB7;
         }
         else
         {
            crc = crc << 1;
         }
      }
   }

   //Return CRC value
   return ~crc;
}
